Catalogs/Слова.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Слова</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Буквы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Буква</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Слова/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Не ОбменДанными.Загрузка Тогда
		Код = Гастроном.СловоНормализовать(Код);
	КонецЕсли;
	Если НЕ ПустаяСтрока(Код) Тогда
		Буквы.Очистить();
		Для Символ = 1 По СтрДлина(Код) Цикл
			ТекСтрока = Буквы.Найти(Сред(Код, Символ, 1), "Буква");
			Если ТекСтрока = Неопределено Тогда
				ТекСтрока = Буквы.Добавить();
				ТекСтрока.Буква = Сред(Код, Символ, 1);
			КонецЕсли;
			ТекСтрока.Количество = ТекСтрока.Количество + 1;
		КонецЦикла;
		Буквы.Сортировать("Буква");
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Буквы.Очистить();
КонецПроцедуры
